[
    {
        "title": "Focusing on What You Can Control",
        "definition": "This principle emphasizes the importance of focusing your time, energy, and thoughts on aspects of life that are within your direct control, rather than worrying about or trying to change things that are not.",
        "keywords": [],
        "references": ["Chapter 1", "Chapter 2", "Chapter 4", "Chapter 6", "Chapter 7", "Chapter 9", "Chapter 10", "Chapter 14", "Chapter 17", "Chapter 19", "Chapter 21", "Chapter 22", "Chapter 23", "Chapter 27", "Chapter 28", "Chapter 29", "Chapter 32", "Chapter 35", "Chapter 36", "Chapter 37", "Chapter 39", "Chapter 41", "Chapter 45", "Chapter 47", "Chapter 49", "Chapter 51", "Chapter 52"],
        "questions": [
            "Am I focusing my efforts on things within my control today?",
            "Where am I expending energy on things outside my control and how can I redirect this?",
            "How can I improve my reactions to uncontrollable events in a way that aligns with my virtues?"
        ]
    },
    {
        "title": "Acceptance of the Natural Order",
        "definition": "This principle encourages accepting the world as it is, rather than how we would like it to be. It involves understanding and aligning oneself with the natural order of the universe, and the unchangeable nature of past events.",
        "keywords": [],
        "references": ["Chapter 3", "Chapter 6", "Chapter 12", "Chapter 15", "Chapter 16", "Chapter 20", "Chapter 25", "Chapter 33", "Chapter 37", "Chapter 40", "Chapter 48", "Chapter 51", "Chapter 52"],
        "questions": [
            "How am I embracing the natural flow of life and its events today?",
            "What challenges did I face today in accepting life's imperfections and how can I better address them?",
            "How is my acceptance of change and imperfection contributing to my well-being?"
        ]
    },
    {
        "title": "Cultivating Inner Virtue",
        "definition": "This principle emphasizes the development of personal virtues such as wisdom, courage, justice, and temperance. Virtue is considered the highest good and the key to a fulfilling and tranquil life.",
        "keywords": [],
        "references": ["Chapter 5", "Chapter 8", "Chapter 11", "Chapter 13", "Chapter 15", "Chapter 16", "Chapter 18", "Chapter 20", "Chapter 24", "Chapter 26", "Chapter 28", "Chapter 32", "Chapter 35", "Chapter 38", "Chapter 40", "Chapter 42", "Chapter 45", "Chapter 50"],
        "questions": [
            "How am I fostering the virtues I value in my actions today?",
            "What virtues did I prioritize today and how can I make them more central to my life?",
            "How did I demonstrate virtue in challenging situations today?"
        ]
    },
    {
        "title": "Differentiating Between Good and Bad",
        "definition": "This principle involves recognizing that 'good' and 'bad' are often subjective and are not inherent qualities of external events, but rather are determined by our judgments and perceptions.",
        "keywords": [],
        "references": ["Chapter 1", "Chapter 5", "Chapter 9", "Chapter 11", "Chapter 13", "Chapter 18", "Chapter 21", "Chapter 24", "Chapter 26", "Chapter 30", "Chapter 34", "Chapter 39", "Chapter 43", "Chapter 46", "Chapter 49"],
        "questions": [
            "How did I distinguish between good and bad in my decisions today?",
            "How did my actions today align with my understanding of what's morally valuable?",
            "Where did I face difficulty in discerning good from bad today and how can I improve?"
        ]
    },
    {
        "title": "Practicing Detachment",
        "definition": "This principle pertains to the practice of emotional and desire-based detachment from external things and outcomes. It is about understanding that happiness and tranquility come from within, not from external possessions or events.",
        "keywords": [],
        "references": ["Chapter 2", "Chapter 4", "Chapter 7", "Chapter 10", "Chapter 19", "Chapter 23", "Chapter 27", "Chapter 31", "Chapter 38", "Chapter 41", "Chapter 47", "Chapter 48"],
        "questions": [
            "What attachments affected my emotions or decisions today and how can I reduce their influence?",
            "How can I cultivate a healthier relationship with my desires to maintain emotional stability?",
            "How did practicing detachment influence my well-being today?"
        ]
    },
    {
        "title": "Facing Adversity with Resilience",
        "definition": "This principle is about developing the capacity to face adversity with calm and resilience, viewing difficulties not as misfortunes, but as opportunities for learning and personal growth.",
        "keywords": [],
        "references": ["Chapter 12", "Chapter 17", "Chapter 22", "Chapter 29", "Chapter 34", "Chapter 42", "Chapter 44", "Chapter 50"],
        "questions": [
            "How did I show resilience in the face of challenges today?",
            "Which coping mechanisms served me best in difficult situations today and why?",
            "How can I use today's adversities as a stepping stone for personal growth and self-improvement?"
        ]
    }
]
